# 애완동물을 소개해 주세요~
animal = "강아지"
name = "연탄이"
age = 4
hobby = "산책"
is_adult = age >= 3



print("우리집" + animal + "의 이름은" + name +"예요")
hobby = "공놀이"
#print(name + "는 " + str(age) +"살이며, " + hobby +"을 아주 좋아해요")
print(name, "는 ", age,"살이며, ", hobby ,"을 아주 좋아해요")
print(name + "는 " "어른일까요? " +str(is_adult) )



# 변수 + "문장 " 큰 따옴표 안 공백 = 띄어쓰기 띄어쓰기
# 중간에 변수를 넣으면 변수 넣은 아랫문장부터 변수 성립
# 문자열 + 쓸 때 정수열을 문자열로 바꿔줘야됨
# ,를 쓰면 정수열을 문자열로 바꿔줄 필요는 없지만 띄어쓰기 처리가 됨
# ctrl + / 하면 주석을 편하게 달 수 있음
# '''을 사용해도 주석을 달 수 있음



